# -*- mode: org; org-confirm-babel-evaluate: nil; coding: utf-8 -*-
#+OPTIONS: org-confirm-babel-evaluate:nil
#+LANGUAGE:  en
#+TEXT:      
#+OPTIONS: ^:{} H:3 num:t \n:nil @:t ::t |:t ^:nil f:t *:t TeX:t LaTeX:t skip:nil p:nil
#+OPTIONS: toc:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="./l3style.css"/>
#+HTML: <div id="toc">
#+TOC: headlines 3        insert TOC here, with two headline levels
#+HTML: </div> 
# 
#+HTML: <div id="org-content">

*** Add repl as appropriate, then examine.
    Make sure the input is correct
    #+BEGIN_SRC sh :session shared :results output :eval never-export
      cd ~/local/sarif-cli/data/codeql-dataflow-sql-injection
      grep -A2 automationDetails sqlidb-1.1.sarif
    #+END_SRC

    #+RESULTS:
    : [32mhohn@gh-hohn [33m~/local/sarif-cli/data/codeql-dataflow-sql-injection[0m
    : "automationDetails" : {
    :       "id" : "mast-issue/"
    :     },
    : 
    : [32mhohn@gh-hohn [33m~/local/sarif-cli/data/codeql-dataflow-sql-injection[0m
   
*** Create the CSV
    #+BEGIN_SRC sh :session shared :results output :eval never-export
      source ~/local/sarif-cli/.venv/bin/activate
      cd ~/local/sarif-cli/data/codeql-dataflow-sql-injection 
      sarif-extract-scans-runner --input-signature CLI - > /dev/null <<EOF
      sqlidb-1.1.sarif
      EOF
    #+END_SRC

    #+RESULTS:
    #+begin_example
    [32mhohn@gh-hohn [33m~/local/sarif-cli/notes[0m
    (.venv) 
    [32mhohn@gh-hohn [33m~/local/sarif-cli/notes[0m
    (.venv) 
    [32mhohn@gh-hohn [33m~/local/sarif-cli/data/codeql-dataflow-sql-injection[0m
    > > (.venv) 
    [32mhohn@gh-hohn [33m~/local/sarif-cli/data/codeql-dataflow-sql-injection[0m
    #+end_example

    #+BEGIN_SRC sh :session shared :results output :eval never-export
      cd ~/local/sarif-cli/data/codeql-dataflow-sql-injection 
      ls -la sqlidb-1.1*
      find sqlidb-1.1.sarif.scantables -print
    #+END_SRC

    #+RESULTS:
    #+begin_example
    [32mhohn@gh-hohn [33m~/local/sarif-cli/data/codeql-dataflow-sql-injection[0m
    -rw-r--r-- 1 hohn staff 8.2K Jul 11 19:25 [0m[0msqlidb-1.1.sarif[0m
    -rw-r--r-- 1 hohn staff  326 Jul 12 16:39 [0msqlidb-1.1.sarif.csv[0m
    -rw-r--r-- 1 hohn staff   72 Jul 12 16:39 [0msqlidb-1.1.sarif.scanspec[0m

    sqlidb-1.1.sarif.scantables:
    total 16K
    drwxr-xr-x  6 hohn staff  192 Jul 12 16:39 [1;34m.[0m/
    drwxr-xr-x 43 hohn staff 1.4K Jul 12 16:39 [1;34m..[0m/
    -rw-r--r--  1 hohn staff  622 Jul 12 16:39 [0mcodeflows.csv[0m
    -rw-r--r--  1 hohn staff  165 Jul 12 16:39 [0mprojects.csv[0m
    -rw-r--r--  1 hohn staff  589 Jul 12 16:39 [0mresults.csv[0m
    -rw-r--r--  1 hohn staff  343 Jul 12 16:39 [0mscans.csv[0m
    (.venv) 
    [32mhohn@gh-hohn [33m~/local/sarif-cli/data/codeql-dataflow-sql-injection[0m
    sqlidb-1.1.sarif.scantables
    sqlidb-1.1.sarif.scantables/codeflows.csv
    sqlidb-1.1.sarif.scantables/scans.csv
    sqlidb-1.1.sarif.scantables/results.csv
    sqlidb-1.1.sarif.scantables/projects.csv
    (.venv) 
    [32mhohn@gh-hohn [33m~/local/sarif-cli/data/codeql-dataflow-sql-injection[0m
    #+end_example

*** Check if automationDetails or its value is in output
    #+BEGIN_SRC sh :session shared :results output :eval never-export
      cd ~/local/sarif-cli/data/codeql-dataflow-sql-injection/sqlidb-1.1.sarif.scantables
      ag automationDetails | cat
    #+END_SRC

    #+RESULTS:
    : (.venv) 
    : [32mhohn@gh-hohn [33m~/local/sarif-cli/data/codeql-dataflow-sql-injection/sqlidb-1.1.sarif.scantables[0m
    : projects.csv:1:"id","project_name","creation_date","repo_url","primary_language","languages_analyzed","automationDetails"
    : (.venv) 
    : [32mhohn@gh-hohn [33m~/local/sarif-cli/data/codeql-dataflow-sql-injection/sqlidb-1.1.sarif.scantables[0m

    #+RESULTS:
    : (.venv) 
    : [32mhohn@gh-hohn [33m~/local/sarif-cli/data/codeql-dataflow-sql-injection/sqlidb-1.1.sarif.scantables[0m
    : (.venv) 
    : [32mhohn@gh-hohn [33m~/local/sarif-cli/data/codeql-dataflow-sql-injection/sqlidb-1.1.sarif.scantables[0m

    #+RESULTS:
    : (.venv) 
    : [32mhohn@gh-hohn [33m~/local/sarif-cli/data/codeql-dataflow-sql-injection/sqlidb-1.1.sarif.scantables[0m
    : (.venv) 
    : [32mhohn@gh-hohn [33m~/local/sarif-cli/data/codeql-dataflow-sql-injection/sqlidb-1.1.sarif.scantables[0m

    See if the magic value is present
    #+BEGIN_SRC sh :session shared :results output :eval never-export
      cd ~/local/sarif-cli/data/codeql-dataflow-sql-injection/sqlidb-1.1.sarif.scantables
      ag mast-issue |cat
    #+END_SRC

    #+RESULTS:
    : (.venv) 
    : [32mhohn@gh-hohn [33m~/local/sarif-cli/data/codeql-dataflow-sql-injection/sqlidb-1.1.sarif.scantables[0m
    : projects.csv:2:490227419655596076,"vcp-no-uri","1970-01-01","vcp-no-uri","unknown","unknown","mast-issue/"
    : (.venv) 
    : [32mhohn@gh-hohn [33m~/local/sarif-cli/data/codeql-dataflow-sql-injection/sqlidb-1.1.sarif.scantables[0m

    #+RESULTS:
    : (.venv) 
    : [32mhohn@gh-hohn [33m~/local/sarif-cli/data/codeql-dataflow-sql-injection/sqlidb-1.1.sarif.scantables[0m
    : (.venv) 
    : [32mhohn@gh-hohn [33m~/local/sarif-cli/data/codeql-dataflow-sql-injection/sqlidb-1.1.sarif.scantables[0m

*** Nothing is in the output, so trace execution to see where it's dropped
    #+BEGIN_SRC sh :session shared :results output :eval never-export
      cd ~/local/sarif-cli/notes && ag -l automationDetails ../sarif_cli  |cat
    #+END_SRC

    #+RESULTS:
    : ../sarif_cli/scan_tables.py
    : ../sarif_cli/signature_single_CLI.py
    : ../sarif_cli/table_joins_CLI.py
    : ../sarif_cli/signature.py
    : (.venv) 
    : [32mhohn@gh-hohn [33m~/local/sarif-cli/notes[0m

